Revit 2026 API

# CategoryIsValid Property

---

Indicates if the Category is valid or not.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsValid { get; }
```
```vb
Public ReadOnly Property IsValid As Boolean
	Get
```
```cpp
public:
property bool IsValid {
	bool get ();
}
```
```fsharp
member IsValid : bool with get
```

#### Property Value

Boolean

A valid Category is one which is present in the Document's Categories.

#### Reference

Category Class

Autodesk.Revit.DB Namespace